app/controllers/pins_controller.rb

	def update
		if @pin.update(pin_params)
---
UPDATE "pins" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "pins"."id" = ?  [["title", "lkjaf fjkajh 12345678"], ["description", "kaf kaf 23467"], ["updated_at", "2017-08-19 12:00:43.074214"], ["id", 2]]

	def create
		@pin = current_user.pins.build(pin_params)

		if @pin.save
---
INSERT INTO "pins" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "kj f agd "], ["description", "s kj jd  jlsdsd  s v"], ["created_at", "2017-08-19 12:39:52.862284"], ["updated_at", "2017-08-19 12:39:52.862284"], ["user_id", 1]]